{
    "Ordinem" : {
        "name" : "Ordinem",
        "activity" : "Design, development, UI, UX",
        "link" : "http://eliedur.be/projets/tfa/",
        "color" : "#49F4C2",
        "category" : "current",
        "alt" : "3 phones with Ordinem launched on",
        "summary" : "Ordinem is a web-app for flat sharing. From UI to UX, design, development, animation, I've made everything. Because we had issues with my roomnates to get daily housework done, I have made this application! ",
        "src" : "assets/images/thumbnails/ordinem.jpg",
        "case_content": {
            "p": "The idea of making a web application came to me because at that time, I was living in a shared flat. There was a problem very present in my daily life, that of getting organized to do tasks. Between the oversights on my part and those of others, it was a real frustration to experience this on a daily basis. During my research I noticed that this was not an isolated case. I was not the only one.",
            "img": "assets/images/case/ordinem/sondage.jpg",
            "p2": "There is a problem, now to solve it you have to think about the causes of this problem. What leads to forgetting to do a task? How to remember it? During this project, I focused my thinking on two angles, my personal opinion of the situation, how I perceive it. As well as the opinion of others through a survey that allows me to see potential solutions. It was a very rewarding project because I was able to learn various things about it, such as the baton effect.",
            "img2": "assets/images/case/ordinem/schema.jpeg",
            "p3": "Why make an application dedicated to this and not stupidly use its calendar? A calendar application is sorely lacking in functionality for this kind of situation. What I have tried to do in this application is to provide real added value compared to a calendar application. For example, there are different types of garbage cans, we would like to know what type of garbage to take out. Then, the possibility of making an alert each in turn very simply allows everyone to participate equitably in the tasks without spending time remembering who did what.",
            "img3": "assets/images/case/ordinem/appli.jpg"
        }

    },
    "Sea of Rust" : {
        "name" : "Sea of Rust",
        "activity" : "Design, development, UI, UX",
        "link" : "https://sea-of-rust.com/",
        "color" : "#b63421",
        "category" : "current",
        "alt" : "Screenshot of Sea Of Rust website",
        "summary" : "Sea of Rust is the landing page of a Rust server. It was the possibility for me to try the framework VueJs and Tailwind CSS. ",
        "src" : "assets/images/thumbnails/sea-of-rust.jpg",
        "case_content": {
            "p": "Le web n’est ma seule passion. Depuis plusieurs années, mon autre passion est le jeu vidéo. Le jeu Rust est l’un des jeux qui m’a marqué durant mon adolescence. Avec plusieurs amis, nous avons eu l’idée de créer un serveur Rust communautaire. ",
            "img": "assets/images/case/sea-of-rust/rust.jpg",
            "p2": "Pour présenter le serveur, ses fonctionnalités, ses caractéristiques, je me suis comme défi de faire un site avec un framework que je n’avais jamais utilisé, VueJS. Je n’ai pas seulement eu le défi d’essayer un framework mais un workflow totalement différent pour l’intégration du site. Afin d’avoir un support en site facile et accessible, j’ai utilisé Vercel avec Github. Pour la gestion des roots et me faciliter la tâche, j’ai utilisé NuxtJS. Enfin, pour ce qui est du style, ce fut aussi une première pour moi d’utiliser Tailwind CSS. Cerise sur le gateau, dans une volonté de d’utiliser les dernières technologies, cela a aussi été l’occasion de prendre connaissance de Vue3 et de composition API. Pour quelqu’un qui n’avait jamais été Vue. Il m’a d’abord fallu comprendre ce qui était pre-existant pour comprendre composition API.",
            "img2": "assets/images/case/sea-of-rust/nuxt.jpeg",
            "p3": "Travailler un workflow totalement différent fut d’un côté libérateur car beaucoup de simplicité en découle avec des outils comme Nuxt, Tailwind. D’un autre côté, ce sont des technologies qui me sont nouvelles. Lorsque quelque chose ne fonctionne pas, il faut beaucoup plus de temps à le régler. Heureusement, j’ai eu des personnes plus expérimentées pour me guider. ",
            "img3": "assets/images/case/sea-of-rust/nuxt.jpeg"
        }

    },
    "Rethinking UX" : {
        "name" : "Rethinking UX",
        "activity" : "UX, UI, Writing",
        "link" : "http://eliedur.be/projets/rethinking-ux/",
        "color" : "#961616",
        "category" : "old",
        "alt" : "Screenshot of the case study",
        "summary" : "During my second year, RUX (Rethinking User Experience) was a workshop to learn more about UX methods. This year, we had the chance to rethink the user experience of the famous KIKK Festival",
        "src" : "assets/images/thumbnails/rux.png",
        "case_content": {
            "p": "Ce projet a été l’occasion pour moi d’en apprendre plus sur l’expérience utilisateur lorsqu’on conçoit pour le web. Cette année, le KIKK Festival nous a été proposé comme élément de recherche et de réflexion.",
            "img": "assets/images/case/rux/kikk.jpeg",
            "p2": "Dans un premier temps, nous avons eu une série de cours sur les diverses méthodologies utilisées dans le domain. Audit, groupe de discussion, top task, user journey, tests utilisateurs, toutes ces pratiques qui m’étaient encore totalement inconnue avant cet atelier. ",
            "img2": "assets/images/case/rux/user_journey.jpeg",
            "p3": "J’ai appris qu’il y avait d’autres champs de compétences que le code et/ou le design. J’ai pu découvrir que l’humain, la manière dont nous fonctionnons était quelque chose d’étudié de près quand il s’agit de concevoir une interface, un site. Cet atelier fut une très bonne entrée en matière qui me permettra plus tard d’appliquer cela dans un projet concret, Ordinem.",
            "img3": "assets/images/case/rux/groupe.jpeg"
        }

    }
}