{
    "Ordinem" : {
        "name" : "Ordinem",
        "activity" : "Design, development, UI, UX",
        "link" : "http://eliedur.be/projets/tfa/",
        "color" : "#49F4C2",
        "category" : "current",
        "alt" : "3 phones with Ordinem launched on",
        "summary" : "Ordinem is a web-app for flat sharing. From UI to UX, design, development, animation, I've made everything. Because we had issues with my roomnates to get daily housework done, I have made this application! ",
        "src" : "assets/images/thumbnails/ordinem.jpg",
        "case_content": {
            "p": "The idea of making a web application came to me because at that time, I was living in a shared flat. There was a problem very present in my daily life, that of getting organized to do tasks. Between the oversights on my part and those of others, it was a real frustration to experience this on a daily basis. During my research I noticed that this was not an isolated case. I was not the only one.",
            "img": "assets/images/case/ordinem/sondage.jpg",
            "p2": "There is a problem, now to solve it you have to think about the causes of this problem. What leads to forgetting to do a task? How to remember it? During this project, I focused my thinking on two angles, my personal opinion of the situation, how I perceive it. As well as the opinion of others through a survey that allows me to see potential solutions. It was a very rewarding project because I was able to learn various things about it, such as the baton effect.",
            "img2": "assets/images/case/ordinem/schema.jpeg",
            "p3": "Why make an application dedicated to this and not stupidly use its calendar? A calendar application is sorely lacking in functionality for this kind of situation. What I have tried to do in this application is to provide real added value compared to a calendar application. For example, there are different types of garbage cans, we would like to know what type of garbage to take out. Then, the possibility of making an alert each in turn very simply allows everyone to participate equitably in the tasks without spending time remembering who did what.",
            "img3": "assets/images/case/ordinem/appli.jpg"
        }

    },
    "Sea of Rust" : {
        "name" : "Sea of Rust",
        "activity" : "Design, development, UI, UX",
        "link" : "https://sea-of-rust.com/",
        "color" : "#b63421",
        "category" : "current",
        "alt" : "Screenshot of Sea Of Rust website",
        "summary" : "Sea of Rust is the landing page of a Rust server. It was the possibility for me to try the framework VueJs and Tailwind CSS. ",
        "src" : "assets/images/thumbnails/sea-of-rust.jpg",
        "case_content": {
            "p": "The web is not my only passion. For several years now, my other passion has been video games. The Rust game was one of the games that marked me during my teenage years. With several friends, we came up with the idea of creating a community Rust server. ",
            "img": "assets/images/case/sea-of-rust/rust.jpg",
            "p2": "To present the server, its functionalities, its characteristics, I challenged myself to make a site with a framework that I had never used, VueJS. I not only had the challenge of trying out a framework but a whole different workflow for the site integration. In order to have easy and accessible on-site support, I used Vercel with Github. To manage the roots and make my job easier, I used NuxtJS. Finally, styling wise, this was also a first for me to use Tailwind CSS. The icing on the cake, in a desire to use the latest technologies, it was also an opportunity to learn about Vue3 and API composition. For someone who had never been Seen. First I had to understand what was pre-existing to understand API composition.",
            "img2": "assets/images/case/sea-of-rust/nuxt.jpeg",
            "p3": "Working a totally different workflow was on the liberating side because a lot of simplicity ensues with tools like Nuxt, Tailwind. On the other hand, these are technologies that are new to me. When something doesn't work, it takes a lot longer to fix it. Fortunately, I had more experienced people to guide me. ",
            "img3": "assets/images/case/sea-of-rust/nuxt.jpeg"
        }

    },
    "Rethinking UX" : {
        "name" : "Rethinking UX",
        "activity" : "UX, UI, Writing",
        "link" : "http://eliedur.be/projets/rethinking-ux/",
        "color" : "#961616",
        "category" : "old",
        "alt" : "Screenshot of the case study",
        "summary" : "During my second year, RUX (Rethinking User Experience) was a workshop to learn more about UX methods. This year, we had the chance to rethink the user experience of the famous KIKK Festival",
        "src" : "assets/images/thumbnails/rux.jpg",
        "case_content": {
            "p": "This project was an opportunity for me to learn more about the user experience when designing for the web. This year, the KIKK Festival was offered to us as an element of research and reflection.",
            "img": "assets/images/case/rux/kikk.jpeg",
            "p2": "First, we had a series of courses on the various methodologies used in the field. Audit, discussion group, top task, user journey, user tests, all of these practices that were completely unknown to me before this workshop. ",
            "img2": "assets/images/case/rux/user_journey.jpeg",
            "p3": "I learned that there are other skill areas besides code and / or design. I was able to discover that the human, the way we operate, is something carefully studied when it comes to designing an interface, a site. This workshop was a very good introduction that will allow me later to apply this in a concrete project, Ordinem.",
            "img3": "assets/images/case/rux/groupe.jpeg"
        }

    }
}